'''
삼각수,오각수,육각수는 공통된거 빼면
t = n(n+1)/2
p = n(3n-1)/2  n번째 오각수는 3n-1번째 삼각수의 1/3과 같다. t(3n-1) = 3*p(n) 어쨌든 t가 3의 배수일 때 가능
h = n(2n-1)'''
n=165
while True:
    n+=1
    p = n*(3*n-1)/2
    
    for i in range(143,n):
        h = i*(2*i-1)
        if h % 3 == 0:
            if h == p :
                print(h)
                break
'''
p 1, 5, 12, 22, 35, 51, 70, 92, 117, 145, 176, 210, 247, 

t 1, 3, 6, 10, 15, 21, 28, 36, 45, 55, 66, 78, 91, 105, 120,
  1     3      5
h 1,    6,     15,     28,     45,     66, 91, 120, 153, 190, 231, 276,  t(2n-1) = h (n-1)
  1     2      3
'''