'''
5
4 + 1
3 + 2
3 + 1 + 1
2 + 2 + 1
2 + 1 + 1 + 1
1 + 1 + 1 + 1 + 1

100일때는?
'''
#l1,l2,l3,l4 =['1','1','1','1'],['2','1','1'],['3','1'],['2','2']
li=[['1','1','1','1'],['2','1','1'],['3','1'],['2','2']]#,li2 =[l1,l2,l3,l4],[l1,l2,l3,l4]

n =4
while True:
    n+=1
    for i in range(len(li)):
        a=li[i]
        if len(li[i]) >=3:
            a1 = li[i][-1] 
            a2 = li[i][-2] 
            minus = int(a2)-int(a1)
            if minus >0:
                a1 = str(int(a1)+1)
        li[i].append('1')
    
            
    if n ==5:break
    

